INSERT INTO clinic_hierarchy (id, parent_id, position)
VALUES (1, NULL, 'Директор клиники'),
       (2, 1, 'Главный врач'),
       (3, 2, 'Врач стоматолог'),
       (4, 2, 'Врач косметолог'),
       (5, 3, 'Ассистент стоматолога'),
       (6, 4, 'Ассистент косметолога'),
       (7, 2, 'Администратор');

INSERT INTO clinic_hierarchy (id, parent_id, position)
VALUES (8,  2, 'Врач ортопед'),
       (9,  8, 'Ассистент ортопеда'),
       (10, 8, 'Медсестра ортопеда'),
       (11, 10, 'Младшая медсестра ортопеда');